; domain
(define 
	(domain world-of-blocks)
	(:requirements :adl) 
	(:predicates
		(na ?na ?pod)
		(na-ziemi ?paczka)
		(arm ?paczka)
	)
	
	;get from the floor
	(:action podnies-z-ziemi
		:parameters (?paczka)
		:precondition
		(and
			(not(exists (?x) (arm ?x)))
			(na-ziemi ?paczka)
			(not(exists (?x) (na ?x ?paczka)))
		)
		:effect
		(and
			(arm ?paczka)
			(not(na-ziemi ?paczka))
		)
	)
	
	;get from the box
	(:action podnies-z-paczki
		:parameters (?paczka ?z)
		:precondition
		(and
			(not(exists (?x) (arm ?x)))
			(not(exists (?x) (na ?x ?paczka)))
			(na ?paczka ?z)
			(not(= ?paczka ?z))
		)
		:effect
		(and
			(not(na ?paczka ?z))
			(arm ?paczka)
		)	
	)
	
	;drop on the floor
	(:action opusc-na-ziemie
		:parameters (?paczka)
		:precondition
		(and
			(arm ?paczka)
		)
		:effect
		(and
			(na-ziemi ?paczka)
			(not(arm ?paczka))
		)
	)
	
	;drop on the another block
	(:action opusc-na-paczke
		:parameters(?paczka ?na)
		:precondition
		(and
			(arm ?paczka)
			(not(= ?paczka ?na))
			(not (arm ?na))
			(not(exists (?x) (na ?x ?na)))
		)
		:effect
		(and
			(not(arm ?paczka))
			(na ?paczka ?na)
		)
	)
)

; problem
(define (problem world-of-blocks)
	(:domain world-of-blocks)
	(:objects
		a b c d e
	)
	(:init		
		(na-ziemi a)
		(na-ziemi d)
		
		(na b a)
		(na c b)
		(na e d)
	)
	(:goal
		(and
			(na d b)
			(exists (?x) (na b ?x))
		)
	)
	
	

)

; plan
1. (podnies-z-paczki c b)
   deleted: (na c b)
   added: (arm c)
   goals met: 1 of 2
2. (opusc-na-ziemie c)
   deleted: (arm c)
   added: (na-ziemi c)
   goals met: 1 of 2
3. (podnies-z-paczki e d)
   deleted: (na e d)
   added: (arm e)
   goals met: 1 of 2
4. (opusc-na-paczke e c)
   deleted: (arm e)
   added: (na e c)
   goals met: 1 of 2
5. (podnies-z-ziemi d)
   deleted: (na-ziemi d)
   added: (arm d)
   goals met: 1 of 2
6. (opusc-na-paczke d b)
   deleted: (arm d)
   added: (na d b)
   goals met: 2 of 2
